[`terraform plan` from the Azure Pipeline](https://calenterprise.visualstudio.com/CDT.OET.CAL-ITP/_build/results?buildId=35310&view=logs&j=bc150913-bfac-577d-ab97-4eb22da69064&t=0dc68013-2e89-56ea-c92f-d8381195fae6)

```console
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_app_service_custom_hostname_binding.main will be created
  + resource "azurerm_app_service_custom_hostname_binding" "main" {
      + app_service_name    = "AS-CDT-PUB-VIP-CALITP-P-001"
      + hostname            = "benefits.calitp.org"
      + id                  = (known after apply)
      + resource_group_name = "RG-CDT-PUB-VIP-CALITP-P-001"
      + ssl_state           = (known after apply)
      + thumbprint          = (known after apply)
      + virtual_ip          = (known after apply)
    }

  # azurerm_linux_web_app.main will be updated in-place
  ~ resource "azurerm_linux_web_app" "main" {
        id                                = "/subscriptions/[REDACTED]/resourceGroups/RG-CDT-PUB-VIP-CALITP-P-001/providers/Microsoft.Web/sites/AS-CDT-PUB-VIP-CALITP-P-001"
        name                              = "AS-CDT-PUB-VIP-CALITP-P-001"
        tags                              = {
            "CreatedOnDate" = "[REDACTED]"
            "rate_code"     = "[REDACTED]"
        }
        # (19 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
                "ANALYTICS_KEY",
              + "DJANGO_ALLOWED_HOSTS",
              + "DJANGO_LOAD_SAMPLE_DATA",
              + "DJANGO_LOG_LEVEL",
              + "DJANGO_MIGRATIONS_DIR",
              + "DJANGO_TRUSTED_ORIGINS",
                "APPINSIGHTS_INSTRUMENTATIONKEY",
                # (4 unchanged elements hidden)
                "ApplicationInsightsAgent_EXTENSION_VERSION",
              - "DJANGO_ALLOWED_HOSTS",
              - "DJANGO_LOAD_SAMPLE_DATA",
              - "DJANGO_LOG_LEVEL",
              - "DJANGO_MIGRATIONS_DIR",
              - "DJANGO_TRUSTED_ORIGINS",
                "DiagnosticServices_EXTENSION_VERSION",
                # (1 unchanged element hidden)
                "SnapshotDebugger_EXTENSION_VERSION",
              - "XDT_MicrosoftApplicationInsightsJava",
                "XDT_MicrosoftApplicationInsights_BaseExtensions",
                # (2 unchanged elements hidden)
                "XDT_MicrosoftApplicationInsights_PreemptSdk",
              + "XDT_MicrosoftApplicationInsightsJava",
            ]
            # (1 unchanged attribute hidden)
        }


        # (6 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```